In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.088164  0.589363  0.043488  1.420501
2013-01-02  0.949353  0.580615  0.810586 -0.545169
2013-01-03  0.537405 -2.118298 -1.271365 -0.373769
2013-01-04 -1.823709  0.849023  0.184302 -1.066463
2013-01-05  0.661024 -0.661223 -1.442322 -1.543373
2013-01-06  0.545022  0.716439  2.251058  0.209991

In [6]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
df2.all

<bound method DataFrame.all of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [9]:
df2.abs

<bound method NDFrame.abs of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [10]:
df2.add

<bound method _arith_method_FRAME.<locals>.f of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [11]:
df.head()

                   A         B         C         D
2013-01-01  0.088164  0.589363  0.043488  1.420501
2013-01-02  0.949353  0.580615  0.810586 -0.545169
2013-01-03  0.537405 -2.118298 -1.271365 -0.373769
2013-01-04 -1.823709  0.849023  0.184302 -1.066463
2013-01-05  0.661024 -0.661223 -1.442322 -1.543373

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.823709  0.849023  0.184302 -1.066463
2013-01-05  0.661024 -0.661223 -1.442322 -1.543373
2013-01-06  0.545022  0.716439  2.251058  0.209991

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [17]:
df

                   A         B         C         D
2013-01-01  0.088164  0.589363  0.043488  1.420501
2013-01-02  0.949353  0.580615  0.810586 -0.545169
2013-01-03  0.537405 -2.118298 -1.271365 -0.373769
2013-01-04 -1.823709  0.849023  0.184302 -1.066463
2013-01-05  0.661024 -0.661223 -1.442322 -1.543373
2013-01-06  0.545022  0.716439  2.251058  0.209991

In [18]:
df.to_numpy()

array([[ 0.08816448,  0.58936304,  0.04348829,  1.42050079],
       [ 0.94935257,  0.5806148 ,  0.81058623, -0.5451687 ],
       [ 0.53740478, -2.11829825, -1.27136515, -0.37376935],
       [-1.82370924,  0.84902336,  0.18430197, -1.06646327],
       [ 0.66102391, -0.66122313, -1.44232161, -1.54337293],
       [ 0.54502245,  0.71643923,  2.25105822,  0.20999054]])

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.159543 -0.007347  0.095958 -0.316380
std    1.010449  1.169843  1.371247  1.040922
min   -1.823709 -2.118298 -1.442322 -1.543373
25%    0.200475 -0.350764 -0.942652 -0.936140
50%    0.541214  0.584989  0.113895 -0.459469
75%    0.632024  0.684670  0.654015  0.064051
max    0.949353  0.849023  2.251058  1.420501

In [20]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.088164    0.949353    0.537405   -1.823709    0.661024    0.545022
B    0.589363    0.580615   -2.118298    0.849023   -0.661223    0.716439
C    0.043488    0.810586   -1.271365    0.184302   -1.442322    2.251058
D    1.420501   -0.545169   -0.373769   -1.066463   -1.543373    0.209991

In [21]:
df.sort_index()

                   A         B         C         D
2013-01-01  0.088164  0.589363  0.043488  1.420501
2013-01-02  0.949353  0.580615  0.810586 -0.545169
2013-01-03  0.537405 -2.118298 -1.271365 -0.373769
2013-01-04 -1.823709  0.849023  0.184302 -1.066463
2013-01-05  0.661024 -0.661223 -1.442322 -1.543373
2013-01-06  0.545022  0.716439  2.251058  0.209991

In [22]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.420501  0.043488  0.589363  0.088164
2013-01-02 -0.545169  0.810586  0.580615  0.949353
2013-01-03 -0.373769 -1.271365 -2.118298  0.537405
2013-01-04 -1.066463  0.184302  0.849023 -1.823709
2013-01-05 -1.543373 -1.442322 -0.661223  0.661024
2013-01-06  0.209991  2.251058  0.716439  0.545022

In [23]:
df.A

2013-01-01    0.088164
2013-01-02    0.949353
2013-01-03    0.537405
2013-01-04   -1.823709
2013-01-05    0.661024
2013-01-06    0.545022
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2013-01-01  0.088164  0.589363  0.043488  1.420501
2013-01-02  0.949353  0.580615  0.810586 -0.545169
2013-01-03  0.537405 -2.118298 -1.271365 -0.373769

In [25]:
df['20130101':'20130104']

                   A         B         C         D
2013-01-01  0.088164  0.589363  0.043488  1.420501
2013-01-02  0.949353  0.580615  0.810586 -0.545169
2013-01-03  0.537405 -2.118298 -1.271365 -0.373769
2013-01-04 -1.823709  0.849023  0.184302 -1.066463

In [26]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.088164  0.589363
2013-01-02  0.949353  0.580615
2013-01-03  0.537405 -2.118298
2013-01-04 -1.823709  0.849023
2013-01-05  0.661024 -0.661223
2013-01-06  0.545022  0.716439

In [27]:
df.loc[:,'A':'C']

                   A         B         C
2013-01-01  0.088164  0.589363  0.043488
2013-01-02  0.949353  0.580615  0.810586
2013-01-03  0.537405 -2.118298 -1.271365
2013-01-04 -1.823709  0.849023  0.184302
2013-01-05  0.661024 -0.661223 -1.442322
2013-01-06  0.545022  0.716439  2.251058

In [28]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.949353  0.580615
2013-01-03  0.537405 -2.118298
2013-01-04 -1.823709  0.849023

In [29]:
df.loc["20130102", ["A", "B"]]

A    0.949353
B    0.580615
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
df.loc[dates[0], "A"]

0.08816448309530975

In [31]:
df

                   A         B         C         D
2013-01-01  0.088164  0.589363  0.043488  1.420501
2013-01-02  0.949353  0.580615  0.810586 -0.545169
2013-01-03  0.537405 -2.118298 -1.271365 -0.373769
2013-01-04 -1.823709  0.849023  0.184302 -1.066463
2013-01-05  0.661024 -0.661223 -1.442322 -1.543373
2013-01-06  0.545022  0.716439  2.251058  0.209991

In [32]:
df.iloc[3]

A   -1.823709
B    0.849023
C    0.184302
D   -1.066463
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.823709  0.849023
2013-01-05  0.661024 -0.661223

In [34]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.949353  0.810586
2013-01-03  0.537405 -1.271365
2013-01-05  0.661024 -1.442322

In [35]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.949353  0.580615  0.810586 -0.545169
2013-01-03  0.537405 -2.118298 -1.271365 -0.373769

In [36]:
df.iloc[1, 1]

0.5806147969213507

In [37]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.088164  0.589363  0.043488  1.420501
2013-01-02  0.949353  0.580615  0.810586 -0.545169
2013-01-03  0.537405 -2.118298 -1.271365 -0.373769
2013-01-05  0.661024 -0.661223 -1.442322 -1.543373
2013-01-06  0.545022  0.716439  2.251058  0.209991

In [38]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.088164  0.589363  0.043488  1.420501
2013-01-02  0.949353  0.580615  0.810586       NaN
2013-01-03  0.537405       NaN       NaN       NaN
2013-01-04       NaN  0.849023  0.184302       NaN
2013-01-05  0.661024       NaN       NaN       NaN
2013-01-06  0.545022  0.716439  2.251058  0.209991

In [39]:
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01  0.088164  0.589363  0.043488  1.420501
2013-01-02  0.949353  0.580615  0.810586 -0.545169
2013-01-03  0.537405 -2.118298 -1.271365 -0.373769
2013-01-04 -1.823709  0.849023  0.184302 -1.066463
2013-01-05  0.661024 -0.661223 -1.442322 -1.543373
2013-01-06  0.545022  0.716439  2.251058  0.209991

In [40]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [41]:
df2

                   A         B         C         D      E
2013-01-01  0.088164  0.589363  0.043488  1.420501    one
2013-01-02  0.949353  0.580615  0.810586 -0.545169    one
2013-01-03  0.537405 -2.118298 -1.271365 -0.373769    two
2013-01-04 -1.823709  0.849023  0.184302 -1.066463  three
2013-01-05  0.661024 -0.661223 -1.442322 -1.543373   four
2013-01-06  0.545022  0.716439  2.251058  0.209991  three

In [42]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.537405 -2.118298 -1.271365 -0.373769   two
2013-01-05  0.661024 -0.661223 -1.442322 -1.543373  four

In [43]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [44]:
df.at[dates[0], "A"] = 0

In [45]:
df.iat[0, 1] = 0

In [46]:
df.loc[:, "D"] = np.array([5] * len(df))

In [47]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.043488  5
2013-01-02  0.949353  0.580615  0.810586  5
2013-01-03  0.537405 -2.118298 -1.271365  5
2013-01-04 -1.823709  0.849023  0.184302  5
2013-01-05  0.661024 -0.661223 -1.442322  5
2013-01-06  0.545022  0.716439  2.251058  5

In [49]:
df1 = df.reindex(index=dates[0:4], columns= list(df.columns)+['E'])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.043488  5  1.0
2013-01-02  0.949353  0.580615  0.810586  5  1.0
2013-01-03  0.537405 -2.118298 -1.271365  5  NaN
2013-01-04 -1.823709  0.849023  0.184302  5  NaN

In [50]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.043488  5  1.0
2013-01-02  0.949353  0.580615  0.810586  5  1.0

In [51]:
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.043488  5  1.0
2013-01-02  0.949353  0.580615  0.810586  5  1.0
2013-01-03  0.537405 -2.118298 -1.271365  5  NaN
2013-01-04 -1.823709  0.849023  0.184302  5  NaN

In [52]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.043488  5  1.0
2013-01-02  0.949353  0.580615  0.810586  5  1.0
2013-01-03  0.537405 -2.118298 -1.271365  5  5.0
2013-01-04 -1.823709  0.849023  0.184302  5  5.0

In [55]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [56]:
df.mean()

A    0.144849
B   -0.105574
C    0.095958
D    5.000000
dtype: float64

In [57]:
df.mean(1)

2013-01-01    1.260872
2013-01-02    1.835138
2013-01-03    0.536935
2013-01-04    1.052404
2013-01-05    0.889370
2013-01-06    2.128130
Freq: D, dtype: float64

In [58]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [59]:
df.sub(s, axis="index")

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -0.462595 -3.118298 -2.271365  4.0
2013-01-04 -4.823709 -2.150977 -2.815698  2.0
2013-01-05 -4.338976 -5.661223 -6.442322  0.0
2013-01-06       NaN       NaN       NaN  NaN

In [60]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  0.043488   5
2013-01-02  0.949353  0.580615  0.854075  10
2013-01-03  1.486757 -1.537683 -0.417291  15
2013-01-04 -0.336952 -0.688660 -0.232989  20
2013-01-05  0.324072 -1.349883 -1.675310  25
2013-01-06  0.869094 -0.633444  0.575748  30

In [61]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    2
1    5
2    5
3    2
4    6
5    2
6    6
7    0
8    6
9    1
dtype: int32

In [62]:
s.value_counts()

6    3
2    3
5    2
1    1
0    1
dtype: int64

In [63]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [67]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [68]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.213330 -0.607693  0.308039  0.038387
1  1.864161  2.948078  1.323058 -0.928176
2 -0.220267 -0.577525 -0.247445  1.199602
3  0.320500 -0.394729  0.421674 -0.827060
4 -0.202214  0.292725  0.966578 -1.548805
5 -0.335385  0.410346  0.902504 -0.245475
6 -0.303965  0.703736  2.248197 -0.619158
7  0.041840 -0.845181 -0.339408 -0.271967
8  1.711719 -1.836844  0.147504  0.999897
9 -1.678476 -0.254000  1.120189  0.977103

In [69]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  1.213330 -0.607693  0.308039  0.038387
 1  1.864161  2.948078  1.323058 -0.928176
 2 -0.220267 -0.577525 -0.247445  1.199602,
           0         1         2         3
 3  0.320500 -0.394729  0.421674 -0.827060
 4 -0.202214  0.292725  0.966578 -1.548805
 5 -0.335385  0.410346  0.902504 -0.245475
 6 -0.303965  0.703736  2.248197 -0.619158,
           0         1         2         3
 7  0.041840 -0.845181 -0.339408 -0.271967
 8  1.711719 -1.836844  0.147504  0.999897
 9 -1.678476 -0.254000  1.120189  0.977103]

In [70]:
pd.concat(pieces)

          0         1         2         3
0  1.213330 -0.607693  0.308039  0.038387
1  1.864161  2.948078  1.323058 -0.928176
2 -0.220267 -0.577525 -0.247445  1.199602
3  0.320500 -0.394729  0.421674 -0.827060
4 -0.202214  0.292725  0.966578 -1.548805
5 -0.335385  0.410346  0.902504 -0.245475
6 -0.303965  0.703736  2.248197 -0.619158
7  0.041840 -0.845181 -0.339408 -0.271967
8  1.711719 -1.836844  0.147504  0.999897
9 -1.678476 -0.254000  1.120189  0.977103

In [71]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

In [72]:
left

   key  lval
0  foo     1
1  foo     2

In [73]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [74]:
right

   key  rval
0  foo     4
1  foo     5

In [75]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [76]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [77]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [79]:
pd.merge(left,right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5